Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/atdf/PIC32CM5164LE00064.atdf
      <value-group name="OPAMP_OPAMPCTRL__POTMUX">
        <value name="14R_2R" caption="R1 = 14R, R2 = 2R" value="0x0"/>
        <value name="12R_4R" caption="R1 = 12R, R2 = 4R" value="0x1"/>
        <value name="8R_8R" caption="R1 = 8R, R2 = 8R" value="0x2"/>
        <value name="6R_10R" caption="R1 = 6R, R2 = 10R" value="0x3"/>
        <value name="4R_12R" caption="R1 = 4R, R2 = 12R" value="0x4"/>
        <value name="3R_13R" caption="R1 = 3R, R2 = 13R" value="0x5"/>
        <value name="2R_14R" caption="R1 = 2R, R2 = 14R" value="0x6"/>
        <value name="R_15R" caption="R1 = 1R, R2 = 15R" value="0x7"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL0__MUXPOS">
        <value name="OA0POS" caption="OPAMP0 Positive Input" value="0x0"/>
        <value name="OA0TAP" caption="OPAMP0 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="REFERENCE or DAC VOUT0 Output" value="0x2"/>
        <value name="GND" caption="Ground" value="0x3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL1__MUXPOS">
        <value name="OA1POS" caption="OPAMP1 Positive Input" value="0x0"/>
        <value name="OA1TAP" caption="OPAMP1 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="REFERENCE or DAC VOUT0 Output" value="0x2"/>
        <value name="GND" caption="Ground" value="0x3"/>
        <value name="OA0OUT" caption="OPAMP0 output" value="0x4"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL2__MUXPOS">
        <value name="OA2POS" caption="OPAMP2 Positive Input" value="0x0"/>
        <value name="OA2TAP" caption="OPAMP2 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="REFERENCE or DAC VOUT0 Output" value="0x2"/>
        <value name="GND" caption="Ground" value="0x3"/>
        <value name="OA1OUT" caption="OPAMP1 Output" value="0x4"/>
        <value name="OA0POS" caption="OPAMP0 Positive Input" value="0x5"/>
        <value name="OA1POS" caption="OPAMP1 Positive Input" value="0x6"/>
        <value name="OA0TAP" caption="OPAMP0 Resistor Ladder Taps" value="0x7"/>
        <value name="RES3TAP" caption="RES3TAP Potentiometer" value="0x8"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL0__MUXNEG">
        <value name="OA0NEG" caption="OPAMP0 Negative Input" value="0x0"/>
        <value name="OA0TAP" caption="OPAMP0 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" value="0x2"/>
        <value name="OA0OUT" caption="OPAMP0 Output" value="0x3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL1__MUXNEG">
        <value name="OA1NEG" caption="OPAMP1 Negative Input" value="0x0"/>
        <value name="OA1TAP" caption="OPAMP1 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" value="0x2"/>
        <value name="OA1OUT" caption="OPAMP1 Output" value="0x3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL2__MUXNEG">
        <value name="OA2NEG" caption="OPAMP2 Negative Input" value="0x0"/>
        <value name="OA2TAP" caption="OPAMP2 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" value="0x2"/>
        <value name="OA2OUT" caption="OPAMP2 Output" value="0x3"/>
        <value name="OA0NEG" caption="OPAMP0 Negative Input" value="0x4"/>
        <value name="OA1NEG" caption="OPAMP1 Negative Input" value="0x5"/>
      </value-group>
      <value-group name="OPAMP_RESCTRL__REFBUFLEVEL">
        <value name="1_1V" caption="1.1V" value="0x0"/>
        <value name="1_25V" caption="1.25V" value="0x1"/>
        <value name="1_6V" caption="1.6V" value="0x2"/>
      </value-group>
      <value-group name="OPAMP_RESCTRL__POTMUX">
        <value name="14R_2R" caption="Gain = 0.14" value="0x0"/>
        <value name="12R_4R" caption="Gain = 0.33" value="0x1"/>
        <value name="8R_8R" caption="Gain = 1" value="0x2"/>
        <value name="6R_10R" caption="Gain = 1.67" value="0x3"/>
        <value name="4R_12R" caption="Gain = 3" value="0x4"/>
        <value name="3R_13R" caption="Gain = 4.33" value="0x5"/>
        <value name="2R_14R" caption="Gain = 7" value="0x6"/>
        <value name="R_15R" caption="Gain = 15" value="0x7"/>
      </value-group>
      <value-group name="OPAMP_RESCTRL__RES1MUX">
        <value name="DAC" caption="DAC VOUT0 Output" value="0x0"/>
        <value name="REFBUF" caption="OPAMP Reference Buffer Output" value="0x1"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2246" version="4.0.0" caption="32k Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32k Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
          <bitfield name="CLKSW" caption="XOSC32K Clock switch" mask="0x8"/>
          <bitfield name="ULP32KSW" caption="OSCULP32K Clock Switch" mask="0x10"/>
        </register>
        <register name="RTCCTRL" offset="0x10" rw="RW" size="1" initval="0x00" caption="RTC Clock Selection">
          <bitfield name="RTCSEL" caption="RTC Clock Selection" mask="0x7" values="OSC32KCTRL_RTCCTRL__RTCSEL"/>
        </register>
